#### Terraform Format and Style 🖌`failure`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
google_project_service.required_apis["bigquery.googleapis.com"]: Refreshing state... [id=recommendation-system-475301/bigquery.googleapis.com]
google_project_service.required_apis["artifactregistry.googleapis.com"]: Refreshing state... [id=recommendation-system-475301/artifactregistry.googleapis.com]
google_project_service.required_apis["cloudbuild.googleapis.com"]: Refreshing state... [id=recommendation-system-475301/cloudbuild.googleapis.com]
google_project_service.required_apis["logging.googleapis.com"]: Refreshing state... [id=recommendation-system-475301/logging.googleapis.com]
google_project_service.required_apis["run.googleapis.com"]: Refreshing state... [id=recommendation-system-475301/run.googleapis.com]
google_project_service.required_apis["aiplatform.googleapis.com"]: Refreshing state... [id=recommendation-system-475301/aiplatform.googleapis.com]
google_project_service.required_apis["monitoring.googleapis.com"]: Refreshing state... [id=recommendation-system-475301/monitoring.googleapis.com]
data.google_project.current: Reading...
data.google_project.current: Read complete after 0s [id=projects/recommendation-system-475301]
google_artifact_registry_repository.docker_repo: Refreshing state... [id=projects/recommendation-system-475301/locations/us-east1/repositories/recommendation-service]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # google_artifact_registry_repository.docker_repo must be replaced
-/+ resource "google_artifact_registry_repository" "docker_repo" {
      - cleanup_policy_dry_run = false -> null
      ~ create_time            = "2025-12-05T22:20:50.828971Z" -> (known after apply)
      ~ id                     = "projects/recommendation-system-475301/locations/us-east1/repositories/recommendation-service" -> (known after apply)
      - labels                 = {} -> null
      ~ location               = "us-east1" -> "us-central1" # forces replacement
      ~ name                   = "recommendation-service" -> (known after apply)
      ~ registry_uri           = "us-east1-docker.pkg.dev/recommendation-system-475301/recommendation-service" -> (known after apply)
      ~ update_time            = "2025-12-05T23:17:53.206095Z" -> (known after apply)
        # (7 unchanged attributes hidden)

      - vulnerability_scanning_config {
          - enablement_state        = "SCANNING_DISABLED" -> null
          - enablement_state_reason = "API containerscanning.googleapis.com is not enabled." -> null
        }
    }

  # google_logging_metric.deployment_events[0] will be created
  + resource "google_logging_metric" "deployment_events" {
      + description = "Model deployment events"
      + filter      = "resource.type=\"aiplatform.googleapis.com/Endpoint\" AND (jsonPayload.event_type=\"DEPLOY\" OR jsonPayload.event_type=\"UNDEPLOY\")"
      + id          = (known after apply)
      + name        = "goodreads-deployment-events"
      + project     = "recommendation-system-475301"

      + metric_descriptor {
          + metric_kind = "DELTA"
          + unit        = "1"
          + value_type  = "INT64"
        }
    }

  # google_logging_metric.prediction_count[0] will be created
  + resource "google_logging_metric" "prediction_count" {
      + description = "Count of prediction requests"
      + filter      = "resource.type=\"aiplatform.googleapis.com/Endpoint\""
      + id          = (known after apply)
      + name        = "goodreads-prediction-count"
      + project     = "recommendation-system-475301"

      + metric_descriptor {
          + metric_kind = "DELTA"
          + unit        = "1"
          + value_type  = "INT64"
        }
    }

  # google_logging_metric.prediction_errors[0] will be created
  + resource "google_logging_metric" "prediction_errors" {
      + description = "Count of prediction errors"
      + filter      = "resource.type=\"aiplatform.googleapis.com/Endpoint\" AND severity>=ERROR"
      + id          = (known after apply)
      + name        = "goodreads-prediction-errors"
      + project     = "recommendation-system-475301"

      + metric_descriptor {
          + metric_kind = "DELTA"
          + unit        = "1"
          + value_type  = "INT64"
        }
    }

  # google_monitoring_alert_policy.data_drift_alert[0] will be created
  + resource "google_monitoring_alert_policy" "data_drift_alert" {
      + combiner              = "OR"
      + creation_record       = (known after apply)
      + display_name          = "Goodreads Data Drift Alert"
      + enabled               = true
      + id                    = (known after apply)
      + name                  = (known after apply)
      + notification_channels = []
      + project               = "recommendation-system-475301"

      + alert_strategy {
          + auto_close = "86400s"
        }

      + conditions {
          + display_name = "PSI Exceeds Threshold"
          + name         = (known after apply)

          + condition_threshold {
              + comparison      = "COMPARISON_GT"
              + duration        = "0s"
              + filter          = "metric.type=\"custom.googleapis.com/ml/goodreads/drift_psi\" AND resource.type=\"global\""
              + threshold_value = 0.2

              + aggregations {
                  + alignment_period   = "3600s"
                  + per_series_aligner = "ALIGN_MAX"
                }
            }
        }

      + documentation {
          + content   = <<-EOT
                ## Data Drift Detected
                
                Significant data drift has been detected in one or more features.
                
                **What this means:**
                - The distribution of input data has shifted from the training baseline
                - Model predictions may become less accurate
                
                **Recommended Actions:**
                1. Review drift reports in `docs/monitoring_reports/`
                2. Investigate recent data changes
                3. Consider retraining the model with recent data
                
                **PSI Interpretation:**
                - PSI < 0.1: No significant shift
                - 0.1 <= PSI < 0.2: Moderate shift (monitor)
                - PSI >= 0.2: Significant shift (action required)
            EOT
          + mime_type = "text/markdown"
        }
    }

  # google_monitoring_alert_policy.model_decay_alert[0] will be created
  + resource "google_monitoring_alert_policy" "model_decay_alert" {
      + combiner              = "OR"
      + creation_record       = (known after apply)
      + display_name          = "Goodreads Model Decay Alert"
      + enabled               = true
      + id                    = (known after apply)
      + name                  = (known after apply)
      + notification_channels = []
      + project               = "recommendation-system-475301"

      + alert_strategy {
          + auto_close = "86400s"
        }

      + conditions {
          + display_name = "RMSE Exceeds Threshold"
          + name         = (known after apply)

          + condition_threshold {
              + comparison      = "COMPARISON_GT"
              + duration        = "300s"
              + filter          = "metric.type=\"custom.googleapis.com/ml/goodreads/rmse\" AND resource.type=\"global\""
              + threshold_value = 1.5

              + aggregations {
                  + alignment_period   = "3600s"
                  + per_series_aligner = "ALIGN_MEAN"
                }

              + trigger {
                  + count = 3
                }
            }
        }
      + conditions {
          + display_name = "R-squared Below Threshold"
          + name         = (known after apply)

          + condition_threshold {
              + comparison      = "COMPARISON_LT"
              + duration        = "300s"
              + filter          = "metric.type=\"custom.googleapis.com/ml/goodreads/r_squared\" AND resource.type=\"global\""
              + threshold_value = 0.3

              + aggregations {
                  + alignment_period   = "3600s"
                  + per_series_aligner = "ALIGN_MEAN"
                }
            }
        }

      + documentation {
          + content   = <<-EOT
                ## Model Decay Detected
                
                The Goodreads recommendation model is showing signs of performance degradation.
                
                **Recommended Actions:**
                1. Check recent data drift reports in `docs/monitoring_reports/`
                2. Review MLflow experiment tracking for metric trends
                3. Consider triggering model retraining if drift is confirmed
                4. Validate data pipeline for any anomalies
                
                **Dashboard:** Access the monitoring dashboard at `/report`
            EOT
          + mime_type = "text/markdown"
        }
    }

  # google_monitoring_dashboard.model_dashboard[0] will be created
  + resource "google_monitoring_dashboard" "model_dashboard" {
      + dashboard_json = jsonencode(
            {
              + displayName  = "Goodreads Model Deployment Dashboard"
              + mosaicLayout = {
                  + columns = 12
                  + tiles   = [
                      + {
                          + height = 4
                          + widget = {
                              + title   = "Prediction Request Count"
                              + xyChart = {
                                  + dataSets = [
                                      + {
                                          + plotType        = "LINE"
                                          + timeSeriesQuery = {
                                              + timeSeriesFilter = {
                                                  + aggregation = {
                                                      + alignmentPeriod  = "60s"
                                                      + perSeriesAligner = "ALIGN_RATE"
                                                    }
                                                  + filter      = "resource.type=\"aiplatform.googleapis.com/Endpoint\" AND metric.type=\"aiplatform.googleapis.com/prediction/online/prediction_count\""
                                                }
                                            }
                                        },
                                    ]
                                  + yAxis    = {
                                      + scale = "LINEAR"
                                    }
                                }
                            }
                          + width  = 6
                        },
                      + {
                          + height = 4
                          + widget = {
                              + title   = "Prediction Latency (P50, P95, P99)"
                              + xyChart = {
                                  + dataSets = [
                                      + {
                                          + plotType        = "LINE"
                                          + timeSeriesQuery = {
                                              + timeSeriesFilter = {
                                                  + aggregation = {
                                                      + alignmentPeriod    = "60s"
                                                      + crossSeriesReducer = "REDUCE_PERCENTILE_50"
                                                      + perSeriesAligner   = "ALIGN_DELTA"
                                                    }
                                                  + filter      = "resource.type=\"aiplatform.googleapis.com/Endpoint\" AND metric.type=\"aiplatform.googleapis.com/prediction/online/response_latencies\""
                                                }
                                            }
                                        },
                                      + {
                                          + plotType        = "LINE"
                                          + timeSeriesQuery = {
                                              + timeSeriesFilter = {
                                                  + aggregation = {
                                                      + alignmentPeriod    = "60s"
                                                      + crossSeriesReducer = "REDUCE_PERCENTILE_95"
                                                      + perSeriesAligner   = "ALIGN_DELTA"
                                                    }
                                                  + filter      = "resource.type=\"aiplatform.googleapis.com/Endpoint\" AND metric.type=\"aiplatform.googleapis.com/prediction/online/response_latencies\""
                                                }
                                            }
                                        },
                                      + {
                                          + plotType        = "LINE"
                                          + timeSeriesQuery = {
                                              + timeSeriesFilter = {
                                                  + aggregation = {
                                                      + alignmentPeriod    = "60s"
                                                      + crossSeriesReducer = "REDUCE_PERCENTILE_99"
                                                      + perSeriesAligner   = "ALIGN_DELTA"
                                                    }
                                                  + filter      = "resource.type=\"aiplatform.googleapis.com/Endpoint\" AND metric.type=\"aiplatform.googleapis.com/prediction/online/response_latencies\""
                                                }
                                            }
                                        },
                                    ]
                                  + yAxis    = {
                                      + scale = "LINEAR"
                                    }
                                }
                            }
                          + width  = 6
                          + xPos   = 6
                        },
                      + {
                          + height = 4
                          + widget = {
                              + title   = "Replica Count"
                              + xyChart = {
                                  + dataSets = [
                                      + {
                                          + plotType        = "LINE"
                                          + timeSeriesQuery = {
                                              + timeSeriesFilter = {
                                                  + aggregation = {
                                                      + alignmentPeriod  = "60s"
                                                      + perSeriesAligner = "ALIGN_MEAN"
                                                    }
                                                  + filter      = "resource.type=\"aiplatform.googleapis.com/Endpoint\" AND metric.type=\"aiplatform.googleapis.com/prediction/online/replicas\""
                                                }
                                            }
                                        },
                                    ]
                                  + yAxis    = {
                                      + scale = "LINEAR"
                                    }
                                }
                            }
                          + width  = 6
                          + yPos   = 4
                        },
                      + {
                          + height = 4
                          + widget = {
                              + title   = "CPU Utilization"
                              + xyChart = {
                                  + dataSets = [
                                      + {
                                          + plotType        = "LINE"
                                          + timeSeriesQuery = {
                                              + timeSeriesFilter = {
                                                  + aggregation = {
                                                      + alignmentPeriod  = "60s"
                                                      + perSeriesAligner = "ALIGN_MEAN"
                                                    }
                                                  + filter      = "resource.type=\"aiplatform.googleapis.com/Endpoint\" AND metric.type=\"aiplatform.googleapis.com/prediction/online/cpu/utilization\""
                                                }
                                            }
                                        },
                                    ]
                                  + yAxis    = {
                                      + scale = "LINEAR"
                                    }
                                }
                            }
                          + width  = 6
                          + xPos   = 6
                          + yPos   = 4
                        },
                    ]
                }
            }
        )
      + id             = (known after apply)
      + project        = "recommendation-system-475301"
    }

  # google_monitoring_metric_descriptor.data_drift_psi[0] will be created
  + resource "google_monitoring_metric_descriptor" "data_drift_psi" {
      + description              = "Population Stability Index for data drift detection"
      + display_name             = "Data Drift PSI"
      + id                       = (known after apply)
      + metric_kind              = "GAUGE"
      + monitored_resource_types = (known after apply)
      + name                     = (known after apply)
      + project                  = "recommendation-system-475301"
      + type                     = "custom.googleapis.com/ml/goodreads/drift_psi"
      + unit                     = "1"
      + value_type               = "DOUBLE"

      + labels {
          + description = "Name of the feature being monitored"
          + key         = "feature_name"
          + value_type  = "STRING"
        }
    }

  # google_monitoring_metric_descriptor.ml_accuracy[0] will be created
  + resource "google_monitoring_metric_descriptor" "ml_accuracy" {
      + description              = "Prediction accuracy within tolerance"
      + display_name             = "Model Accuracy"
      + id                       = (known after apply)
      + metric_kind              = "GAUGE"
      + monitored_resource_types = (known after apply)
      + name                     = (known after apply)
      + project                  = "recommendation-system-475301"
      + type                     = "custom.googleapis.com/ml/goodreads/accuracy"
      + unit                     = "%"
      + value_type               = "DOUBLE"

      + labels {
          + description = "Name of the ML model"
          + key         = "model_name"
          + value_type  = "STRING"
        }
      + labels {
          + description = "Tolerance level (0.5 or 1.0)"
          + key         = "tolerance"
          + value_type  = "STRING"
        }
    }

  # google_monitoring_metric_descriptor.ml_mae[0] will be created
  + resource "google_monitoring_metric_descriptor" "ml_mae" {
      + description              = "Mean Absolute Error for ML model predictions"
      + display_name             = "Model MAE"
      + id                       = (known after apply)
      + metric_kind              = "GAUGE"
      + monitored_resource_types = (known after apply)
      + name                     = (known after apply)
      + project                  = "recommendation-system-475301"
      + type                     = "custom.googleapis.com/ml/goodreads/mae"
      + unit                     = "1"
      + value_type               = "DOUBLE"

      + labels {
          + description = "Name of the ML model"
          + key         = "model_name"
          + value_type  = "STRING"
        }
    }

  # google_monitoring_metric_descriptor.ml_r_squared[0] will be created
  + resource "google_monitoring_metric_descriptor" "ml_r_squared" {
      + description              = "R-squared coefficient for ML model predictions"
      + display_name             = "Model R-squared"
      + id                       = (known after apply)
      + metric_kind              = "GAUGE"
      + monitored_resource_types = (known after apply)
      + name                     = (known after apply)
      + project                  = "recommendation-system-475301"
      + type                     = "custom.googleapis.com/ml/goodreads/r_squared"
      + unit                     = "1"
      + value_type               = "DOUBLE"

      + labels {
          + description = "Name of the ML model"
          + key         = "model_name"
          + value_type  = "STRING"
        }
    }

  # google_monitoring_metric_descriptor.ml_rmse[0] will be created
  + resource "google_monitoring_metric_descriptor" "ml_rmse" {
      + description              = "Root Mean Square Error for ML model predictions"
      + display_name             = "Model RMSE"
      + id                       = (known after apply)
      + metric_kind              = "GAUGE"
      + monitored_resource_types = (known after apply)
      + name                     = (known after apply)
      + project                  = "recommendation-system-475301"
      + type                     = "custom.googleapis.com/ml/goodreads/rmse"
      + unit                     = "1"
      + value_type               = "DOUBLE"

      + labels {
          + description = "Name of the ML model"
          + key         = "model_name"
          + value_type  = "STRING"
        }
    }

  # google_project_iam_member.cloud_run_sa_bigquery_data_editor will be created
  + resource "google_project_iam_member" "cloud_run_sa_bigquery_data_editor" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:cloud-run-reco-sa@recommendation-system-475301.iam.gserviceaccount.com"
      + project = "recommendation-system-475301"
      + role    = "roles/bigquery.dataEditor"
    }

  # google_project_iam_member.cloud_run_sa_bigquery_data_viewer will be created
  + resource "google_project_iam_member" "cloud_run_sa_bigquery_data_viewer" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:cloud-run-reco-sa@recommendation-system-475301.iam.gserviceaccount.com"
      + project = "recommendation-system-475301"
      + role    = "roles/bigquery.dataViewer"
    }

  # google_project_iam_member.cloud_run_sa_bigquery_user will be created
  + resource "google_project_iam_member" "cloud_run_sa_bigquery_user" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:cloud-run-reco-sa@recommendation-system-475301.iam.gserviceaccount.com"
      + project = "recommendation-system-475301"
      + role    = "roles/bigquery.user"
    }

  # google_project_iam_member.deployer_bigquery_reader[0] will be created
  + resource "google_project_iam_member" "deployer_bigquery_reader" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:goodreads-model-deployer@recommendation-system-475301.iam.gserviceaccount.com"
      + project = "recommendation-system-475301"
      + role    = "roles/bigquery.dataViewer"
    }

  # google_project_iam_member.deployer_logging[0] will be created
  + resource "google_project_iam_member" "deployer_logging" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:goodreads-model-deployer@recommendation-system-475301.iam.gserviceaccount.com"
      + project = "recommendation-system-475301"
      + role    = "roles/logging.logWriter"
    }

  # google_project_iam_member.deployer_storage_admin[0] will be created
  + resource "google_project_iam_member" "deployer_storage_admin" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:goodreads-model-deployer@recommendation-system-475301.iam.gserviceaccount.com"
      + project = "recommendation-system-475301"
      + role    = "roles/storage.admin"
    }

  # google_project_iam_member.deployer_vertex_admin[0] will be created
  + resource "google_project_iam_member" "deployer_vertex_admin" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:goodreads-model-deployer@recommendation-system-475301.iam.gserviceaccount.com"
      + project = "recommendation-system-475301"
      + role    = "roles/aiplatform.admin"
    }

  # google_project_iam_member.serving_bigquery_reader[0] will be created
  + resource "google_project_iam_member" "serving_bigquery_reader" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:goodreads-model-serving@recommendation-system-475301.iam.gserviceaccount.com"
      + project = "recommendation-system-475301"
      + role    = "roles/bigquery.dataViewer"
    }

  # google_project_iam_member.serving_logging[0] will be created
  + resource "google_project_iam_member" "serving_logging" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:goodreads-model-serving@recommendation-system-475301.iam.gserviceaccount.com"
      + project = "recommendation-system-475301"
      + role    = "roles/logging.logWriter"
    }

  # google_project_iam_member.serving_vertex_user[0] will be created
  + resource "google_project_iam_member" "serving_vertex_user" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:goodreads-model-serving@recommendation-system-475301.iam.gserviceaccount.com"
      + project = "recommendation-system-475301"
      + role    = "roles/aiplatform.user"
    }

  # google_service_account.cloud_run_sa will be created
  + resource "google_service_account" "cloud_run_sa" {
      + account_id   = "cloud-run-reco-sa"
      + disabled     = false
      + display_name = "Cloud Run Recommendation Service SA"
      + email        = "cloud-run-reco-sa@recommendation-system-475301.iam.gserviceaccount.com"
      + id           = (known after apply)
      + member       = "serviceAccount:cloud-run-reco-sa@recommendation-system-475301.iam.gserviceaccount.com"
      + name         = (known after apply)
      + project      = "recommendation-system-475301"
      + unique_id    = (known after apply)
    }

  # google_service_account.model_deployer[0] will be created
  + resource "google_service_account" "model_deployer" {
      + account_id   = "goodreads-model-deployer"
      + description  = "Service account for automated model deployment"
      + disabled     = false
      + display_name = "Goodreads Model Deployer Service Account"
      + email        = "goodreads-model-deployer@recommendation-system-475301.iam.gserviceaccount.com"
      + id           = (known after apply)
      + member       = "serviceAccount:goodreads-model-deployer@recommendation-system-475301.iam.gserviceaccount.com"
      + name         = (known after apply)
      + project      = "recommendation-system-475301"
      + unique_id    = (known after apply)
    }

  # google_service_account.model_serving[0] will be created
  + resource "google_service_account" "model_serving" {
      + account_id   = "goodreads-model-serving"
      + description  = "Service account for model serving endpoints"
      + disabled     = false
      + display_name = "Goodreads Model Serving Service Account"
      + email        = "goodreads-model-serving@recommendation-system-475301.iam.gserviceaccount.com"
      + id           = (known after apply)
      + member       = "serviceAccount:goodreads-model-serving@recommendation-system-475301.iam.gserviceaccount.com"
      + name         = (known after apply)
      + project      = "recommendation-system-475301"
      + unique_id    = (known after apply)
    }

  # google_service_account_iam_member.deployer_can_impersonate_serving[0] will be created
  + resource "google_service_account_iam_member" "deployer_can_impersonate_serving" {
      + etag               = (known after apply)
      + id                 = (known after apply)
      + member             = "serviceAccount:goodreads-model-deployer@recommendation-system-475301.iam.gserviceaccount.com"
      + role               = "roles/iam.serviceAccountUser"
      + service_account_id = (known after apply)
    }

  # google_vertex_ai_endpoint.recommendation_endpoint will be created
  + resource "google_vertex_ai_endpoint" "recommendation_endpoint" {
      + create_time                     = (known after apply)
      + dedicated_endpoint_dns          = (known after apply)
      + deployed_models                 = (known after apply)
      + description                     = "Endpoint for Goodreads book recommendation model"
      + display_name                    = "goodreads-recommendation-endpoint"
      + effective_labels                = {
          + "environment"                = "prod"
          + "goog-terraform-provisioned" = "true"
          + "managed_by"                 = "terraform"
          + "project"                    = "goodreads-recommendations"
        }
      + etag                            = (known after apply)
      + id                              = (known after apply)
      + labels                          = {
          + "environment" = "prod"
          + "managed_by"  = "terraform"
          + "project"     = "goodreads-recommendations"
        }
      + location                        = "us-central1"
      + model_deployment_monitoring_job = (known after apply)
      + name                            = "goodreads-recommendation-endpoint"
      + project                         = "recommendation-system-475301"
      + terraform_labels                = {
          + "environment"                = "prod"
          + "goog-terraform-provisioned" = "true"
          + "managed_by"                 = "terraform"
          + "project"                    = "goodreads-recommendations"
        }
      + traffic_split                   = (known after apply)
      + update_time                     = (known after apply)
    }

Plan: 27 to add, 0 to change, 1 to destroy.

Changes to Outputs:
  + deployer_service_account = "goodreads-model-deployer@recommendation-system-475301.iam.gserviceaccount.com"
  + endpoint_id              = "goodreads-recommendation-endpoint"
  + endpoint_predict_url     = (known after apply)
  + endpoint_resource_name   = (known after apply)
  + monitoring_dashboard_url = (known after apply)
  ~ region                   = "us-east1" -> "us-central1"
  + serving_service_account  = "goodreads-model-serving@recommendation-system-475301.iam.gserviceaccount.com"

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"

```

</details>

*Pusher: @purva-agarwal, Action: `pull_request`, Workflow: `Terraform Infrastructure`*